In [1]:
import pandas as pd

In [2]:
import numpy as np

# 특정 데이터를 가져오가

In [3]:

data_url = 'http://vincentarelbundock.github.io/Rdatasets/csv/carData/Salaries.csv'
df = pd.read_csv(data_url, index_col=0)
 
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [4]:
df['diff'] = df['yrs.since.phd']-  df['yrs.service']

In [5]:
(df['diff'] < 0 ).sum()

16

In [6]:
df[df['diff'] < 0 ]

          rank discipline  yrs.since.phd  yrs.service     sex  salary  diff
5         Prof          B             40           41    Male  141500    -1
17        Prof          B             19           20    Male  101000    -1
70        Prof          B             28           36    Male   91412    -8
85        Prof          B             17           18  Female  122960    -1
132       Prof          A             56           57    Male   76840    -1
157  AssocProf          B             12           18    Male  113341    -6
160       Prof          B             15           16    Male  137167    -1
168       Prof          B             18           19    Male  130664    -1
195  AssocProf          B             48           53    Male   90000    -5
245       Prof          A             19           23    Male   84273    -4
325       Prof          B             30           31    Male  162221    -1
331       Prof          B             49           60    Male  192253   -11
336       Prof          B             36           38    Male  151445    -2
345       Prof          B             32           35    Male  150376    -3
350       Prof          B             27           28    Male  144309    -1
353       Prof          B             26           27    Male  142500    -1

In [7]:
df.columns

Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary',
       'diff'],
      dtype='object')

### 칼럼 내의 값 정보 확인하기

In [8]:
df['rank'].value_counts()

Prof         266
AsstProf      67
AssocProf     64
Name: rank, dtype: int64

In [9]:
df['rank'].unique()

array(['Prof', 'AsstProf', 'AssocProf'], dtype=object)

In [10]:
df_prof = df[df['rank'] == 'Prof']

In [11]:
df_prof.shape

(266, 7)

# 그룹화하기

In [12]:
# Grouping by one factor
df_rank = df.groupby('rank')

In [13]:
df_rank

## 1. 특정 그룹별호 확인하기

In [14]:
df_rank.get_group('Prof').shape

(266, 7)

In [15]:
df_rank.get_group('AsstProf').shape

(67, 7)

In [16]:
df_rank.get_group('AssocProf').shape

(64, 7)

In [17]:
import IPython

# Getting all methods from the groupby object:
meth = [method_name for method_name in dir(df_rank)
 if callable(getattr(df_rank, method_name)) & ~method_name.startswith('_')]
 
# Printing the result
print(IPython.utils.text.columnize(meth))

agg        corr      cumsum     head    median      pipe      shift      tshift
aggregate  corrwith  describe   hist    min         plot      size       var
all        count     expanding  idxmax  ngroup      prod      skew
any        cov       ffill      idxmin  nth         quantile  std
apply      cumcount  fillna     last    nunique     rank      sum
backfill   cummax    filter     mad     ohlc        resample  tail
bfill      cummin    first      max     pad         rolling   take
boxplot    cumprod   get_group  mean    pct_change  sem       transform

### 그룹된 내용 확인

In [18]:
df_rank.groups

{'AssocProf': Int64Index([  6,  11,  25,  40,  42,  55,  56,  58,  59,  61,  64,  66,  90,
              92,  93,  97, 105, 107, 108, 109, 112, 124, 131, 133, 139, 141,
             142, 154, 157, 159, 163, 169, 175, 177, 178, 183, 187, 189, 194,
             195, 196, 215, 218, 219, 223, 228, 232, 256, 258, 261, 285, 286,
             294, 300, 317, 322, 323, 329, 335, 364, 368, 371, 380, 383],
            dtype='int64'),
 'AsstProf': Int64Index([  3,  12,  13,  14,  28,  29,  32,  34,  35,  36,  38,  50,  53,
              60,  62,  65,  76,  79,  80,  84,  88,  91,  96, 113, 119, 120,
             128, 130, 134, 144, 147, 150, 152, 155, 158, 161, 164, 165, 171,
             180, 197, 198, 201, 209, 211, 227, 235, 238, 241, 254, 259, 273,
             274, 275, 288, 290, 307, 309, 316, 326, 349, 355, 360, 377, 378,
             381, 397],
            dtype='int64'),
 'Prof': Int64Index([  1,   2,   4,   5,   7,   8,   9,  10,  15,  16,
             ...
             387, 388, 389, 390, 391, 392, 393, 394, 395, 396],
            dtype='int64', length=266)}

### 특정 그룹만 불러와서 처리하기

In [19]:
df_rank.get_group('AsstProf').head()

   discipline  yrs.since.phd  yrs.service   sex  salary  diff
3           B              4            3  Male   79750     1
12          B              7            2  Male   79800     5
13          B              1            1  Male   77700     0
14          B              2            0  Male   78000     2
28          B              5            3  Male   82379     2

### 특정 그룹의 개수 확인하기

In [20]:
df_rank.size()

rank
AssocProf     64
AsstProf      67
Prof         266
dtype: int64

In [21]:
df_rank.count()

           discipline  yrs.since.phd  yrs.service  sex  salary  diff
rank
AssocProf          64             64           64   64      64    64
AsstProf           67             67           67   67      67    67
Prof              266            266          266  266     266   266

### 유일한 값만 확인하기

In [22]:
df_rank.nunique()

           discipline  yrs.since.phd  yrs.service  sex  salary  diff
rank
AssocProf           2             24           21    2      63    16
AsstProf            2             11            7    2      53    10
Prof                2             42           50    2     261    30

#### 데이터를 읽어와서 유일한 값만 조회

In [23]:
type(df_rank.get_group('AsstProf')['discipline'])

pandas.core.series.Series

In [24]:
df_rank.get_group('AsstProf')['discipline'].unique()

array(['B', 'A'], dtype=object)

## 2. 마스킹 처리 알아보기

###  특정 값이 .1 보다 작은 값을 추출

In [47]:
np.random.random(df.shape) < .1

array([[ True, False, False, ..., False, False, False],
       [False, False, False, ...,  True, False, False],
       [False, False, False, ..., False, False, False],
       ...,
       [False, False, False, ..., False, False,  True],
       [False, False, False, ..., False, False, False],
       [ True, False, False, ..., False, False, False]])

### 위의 조건으로 기존 데이터프레임에 mask로 처리하면  True 에서 nan 값이 발생

In [48]:
df_null = df.mask(np.random.random(df.shape) < .1)

In [51]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary  diff
1      Prof          B             19           18  Male  139750     1
2      Prof          B             20           16  Male  173200     4
3  AsstProf          B              4            3  Male   79750     1
4      Prof          B             45           39  Male  115000     6
5      Prof          B             40           41  Male  141500    -1

In [50]:
df_null.head()

       rank discipline  yrs.since.phd  yrs.service   sex    salary  diff
1      Prof          B           19.0         18.0   NaN  139750.0   NaN
2      Prof          B           20.0         16.0  Male       NaN   4.0
3  AsstProf          B            4.0          3.0  Male   79750.0   1.0
4      Prof          B            NaN         39.0  Male  115000.0   6.0
5      Prof          B           40.0         41.0  Male  141500.0  -1.0

### nan 갑에 대해 개수를 확인

In [53]:
df_null.isnull().sum()

rank             30
discipline       46
yrs.since.phd    41
yrs.service      46
sex              38
salary           51
diff             49
dtype: int64

### reset index로 처리하면 시리즈가 데이터프레임으로 변환되고 값에 들어간 부분에 칼럼명이 부여되었다

In [54]:
help(pd.Series.reset_index)

Help on function reset_index in module pandas.core.series:

reset_index(self, level=None, drop=False, name=None, inplace=False)
    Generate a new DataFrame or Series with the index reset.

    This is useful when the index needs to be treated as a column, or
    when the index is meaningless and needs to be reset to the default
    before another operation.

    Parameters
    ----------
    level : int, str, tuple, or list, default optional
        For a Series with a MultiIndex, only remove the specified levels
        from the index. Removes all levels by default.
    drop : bool, default False
        Just reset the index, without inserting it as a column in
        the new DataFrame.
    name : object, optional
        The name to use for the column containing the original Series
        values. Uses ``self.name`` by default. This argument is ignored
        when `drop` is True.
    inplace : bool, default False
        Modify the Series in place (do not create a new object).

    Returns
    -------
    Series or DataFrame
        When `drop` is False (the default), a DataFrame is returned.
        The newly created columns will come first in the DataFrame,
        followed by the original Series values.
        When `drop` is True, a `Series` is returned.
        In either case, if ``inplace=True``, no value is returned.

    See Also
    --------
    DataFrame.reset_index: Analogous function for DataFrame.

    Examples
    --------
    >>> s = pd.Series([1, 2, 3, 4], name='foo',
    ...               index=pd.Index(['a', 'b', 'c', 'd'], name='idx'))

    Generate a DataFrame with default index.

    >>> s.reset_index()
      idx  foo
    0   a    1
    1   b    2
    2   c    3
    3   d    4

    To specify the name of the new column use `name`.

    >>> s.reset_index(name='values')
      idx  values
    0   a       1
    1   b       2
    2   c       3
    3   d       4

    To generate a new Series with the default set `drop` to True.

    >>> s.reset_index(drop=True)
    0    1
    1    2
    2    3
    3    4
    Name: foo, dtype: int64

    To update the Series in place, without generating a new one
    set `inplace` to True. Note that it also requires ``drop=True``.

    >>> s.reset_index(inplace=True, drop=True)
    >>> s
    0    1
    1    2
    2    3
    3    4
    Name: foo, dtype: int64

    The `level` parameter is interesting for Series with a multi-level
    index.

    >>> arrays = [np.array(['bar', 'bar', 'baz', 'baz']),
    ...           np.array(['one', 'two', 'one', 'two'])]
    >>> s2 = pd.Series(
    ...     range(4), name='foo',
    ...     index=pd.MultiIndex.from_arrays(arrays,
    ...                                     names=['a', 'b']))

    To remove a specific level from the Index, use `level`.

    >>> s2.reset_index(level='a')
           a  foo
    b
    one  bar    0
    two  bar    1
    one  baz    2
    two  baz    3

    If `level` is not set, all levels are removed from the Index.

    >>> s2.reset_index()
         a    b  foo
    0  bar  one    0
    1  bar  two    1
    2  baz  one    2
    3  baz  two    3

In [52]:

df_null.isnull().sum().reset_index(name='N Missing Values')

           index  N Missing Values
0           rank                30
1     discipline                46
2  yrs.since.phd                41
3    yrs.service                46
4            sex                38
5         salary                51
6           diff                49

In [26]:
df_null.groupby('rank').nunique()

           rank  discipline  yrs.since.phd  yrs.service  sex  salary  diff
rank
AssocProf     1           2             21           16    2      51    13
AsstProf      1           2             11            6    2      46    10
Prof          1           2             39           45    2     203    29

### 연봉에 대한 평균을 구한 후에 reset_index 처리

In [55]:
df_rank['salary'].mean()

rank
AssocProf     93876.437500
AsstProf      80775.985075
Prof         126772.109023
Name: salary, dtype: float64

In [27]:

df_rank['salary'].mean().reset_index()

        rank         salary
0  AssocProf   93876.437500
1   AsstProf   80775.985075
2       Prof  126772.109023

In [28]:
df_rank['salary'].mean().reset_index().rename(columns={'rank':'Rank','salary' : 'Mean Salary'})

        Rank    Mean Salary
0  AssocProf   93876.437500
1   AsstProf   80775.985075
2       Prof  126772.109023

In [29]:

df.groupby('rank')['salary'].median().reset_index().rename(columns={'rank':'Rank','salary' : 'MedianSalary'})

        Rank  MedianSalary
0  AssocProf       95626.5
1   AsstProf       79800.0
2       Prof      123321.5

## 3.  그룹화 된 것을 임의의 함수로 그룹화 연산 처리하기

### 다양한 함수를 처리한 후에 결과값을 처리하기 위해 reset_index cjfl

In [58]:
a = df_rank['salary'].agg(['mean', 'median', 'std', 'min', 'max'])

In [59]:
a.columns

Index(['mean', 'median', 'std', 'min', 'max'], dtype='object')

In [60]:
a.index

Index(['AssocProf', 'AsstProf', 'Prof'], dtype='object', name='rank')

### 인덱스를 칼럼으로 전환

In [56]:
df_rank['salary'].agg(['mean', 'median', 'std', 'min', 'max']).reset_index()

        rank           mean    median           std    min     max
0  AssocProf   93876.437500   95626.5  13831.699844  62884  126431
1   AsstProf   80775.985075   79800.0   8174.112637  63100   97032
2       Prof  126772.109023  123321.5  27718.674999  57800  231545

### 함수를 정의해서 계산하기

In [31]:

def salary_range(df):
    mini = df.min()
    maxi = df.max()
    rang = '%s - %s' % (mini, maxi)
    
    return rang
 
df_descriptive = df_rank['salary'].agg(['mean', 'median', 'std', salary_range]).reset_index()

In [32]:
df_descriptive

        rank           mean    median           std    salary_range
0  AssocProf   93876.437500   95626.5  13831.699844  62884 - 126431
1   AsstProf   80775.985075   79800.0   8174.112637   63100 - 97032
2       Prof  126772.109023  123321.5  27718.674999  57800 - 231545

### 칼럼이름을 변경하기

In [33]:
# Renaming Pandas Dataframe Columns
df_descriptive.rename(columns={'rank':'Rank', 'mean':'Mean', 'median':'Median', 
                               'std':'Standard Deviation', 'salary_range':'Range'})

        Rank           Mean    Median  Standard Deviation           Range
0  AssocProf   93876.437500   95626.5        13831.699844  62884 - 126431
1   AsstProf   80775.985075   79800.0         8174.112637   63100 - 97032
2       Prof  126772.109023  123321.5        27718.674999  57800 - 231545

In [34]:

from scipy.stats.mstats import gmean, hmean
 
df_descriptive = df_rank['salary'].agg(['mean', 'median', hmean, gmean]).reset_index()
df_descriptive

        rank           mean    median          hmean          gmean
0  AssocProf   93876.437500   95626.5   91784.174692   92844.275276
1   AsstProf   80775.985075   79800.0   79958.539934   80367.469951
2       Prof  126772.109023  123321.5  120947.872093  123836.108080

## 4. 여러 칼럼으로 그룹화 하기

In [35]:

df_grp = df.groupby(['rank', 'discipline'])
df_grp.size().reset_index(name='count')

        rank discipline  count
0  AssocProf          A     26
1  AssocProf          B     38
2   AsstProf          A     24
3   AsstProf          B     43
4       Prof          A    131
5       Prof          B    135

In [36]:

# Get two groups
df_grp.get_group(('AssocProf', 'A')).head()

          rank discipline  yrs.since.phd  yrs.service     sex  salary  diff
25   AssocProf          A             13            8  Female   74830     5
105  AssocProf          A             18           10    Male   83850     8
107  AssocProf          A             11            8    Male   82099     3
108  AssocProf          A             10            8    Male   82600     2
109  AssocProf          A             15            8    Male   81500     7

In [37]:

df_3grps = df.groupby(['rank', 'discipline', 'sex'])
df_n_per_group = df_3grps.size().reset_index(name='n')

In [38]:

perc = df.groupby(['rank', 'discipline', 'sex'])['salary'].size()
 
# Give the percentage on the level of Rank:
percbyrank = perc.groupby(level=0).apply(lambda x: 100 * x / float(x.sum()))
 
print(percbyrank)
print('Total percentage in group AssocProf. ',
      percbyrank.reset_index().query('rank == "AssocProf"')['salary'].sum())

rank       discipline  sex
AssocProf  A           Female     6.250000
                       Male      34.375000
           B           Female     9.375000
                       Male      50.000000
AsstProf   A           Female     8.955224
                       Male      26.865672
           B           Female     7.462687
                       Male      56.716418
Prof       A           Female     3.007519
                       Male      46.240602
           B           Female     3.759398
                       Male      46.992481
Name: salary, dtype: float64
Total percentage in group AssocProf.  100.0

In [39]:

n = perc.reset_index()['salary'].sum()
totalperc =  perc.groupby(level=0).apply(lambda x: 100 * x / n).reset_index(name='% of total n')
totalperc.reset_index()

    index       rank discipline     sex  % of total n
0       0  AssocProf          A  Female      1.007557
1       1  AssocProf          A    Male      5.541562
2       2  AssocProf          B  Female      1.511335
3       3  AssocProf          B    Male      8.060453
4       4   AsstProf          A  Female      1.511335
5       5   AsstProf          A    Male      4.534005
6       6   AsstProf          B  Female      1.259446
7       7   AsstProf          B    Male      9.571788
8       8       Prof          A  Female      2.015113
9       9       Prof          A    Male     30.982368
10     10       Prof          B  Female      2.518892
11     11       Prof          B    Male     31.486146

## 데이터 프레임으로 변환하기

In [40]:

df_rn = df.groupby(['rank', 'discipline']).mean()

In [41]:
type(df_rn)

pandas.core.frame.DataFrame

In [42]:

df_rn.index

MultiIndex(levels=[['AssocProf', 'AsstProf', 'Prof'], ['A', 'B']],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['rank', 'discipline'])

In [43]:
df_rn

                      yrs.since.phd  yrs.service         salary      diff
rank      discipline
AssocProf A               17.846154    13.500000   83061.115385  4.346154
          B               13.815789    10.894737  101276.394737  2.921053
AsstProf  A                5.666667     2.416667   73935.541667  3.250000
          B                4.790698     2.348837   84593.906977  2.441860
Prof      A               30.488550    24.442748  119948.274809  6.045802
          B               26.177778    21.237037  133393.755556  4.940741

### 단일 인덱스로 변환하기

In [44]:

df_rn = df_rn.add_suffix('_Mean').reset_index()
type(df_rn)

pandas.core.frame.DataFrame

In [45]:
df_rn

,rank,discipline,yrs.since.phd_Mean,yrs.service_Mean,salary_Mean,diff_Mean
0,AssocProf,A,17.846154,13.500000,83061.115385,4.346154
1,AssocProf,B,13.815789,10.894737,101276.394737,2.921053
2,AsstProf,A,5.666667,2.416667,73935.541667,3.250000
3,AsstProf,B,4.790698,2.348837,84593.906977,2.441860
4,Prof,A,30.488550,24.442748,119948.274809,6.045802
5,Prof,B,26.177778,21.237037,133393.755556,4.940741

In [46]:

df_stats = df.groupby(['rank', 'discipline', 'sex']).agg(['mean', 'median', 'std'])
df_stats.columns = ["_".join(x) for x in df_stats.columns.ravel()]
 
df_stats.iloc[:,0:6].reset_index()

,rank,discipline,sex,yrs.since.phd_mean,yrs.since.phd_median,yrs.since.phd_std,yrs.service_mean,yrs.service_median,yrs.service_std
0,AssocProf,A,Female,18.500000,19.0,8.185353,15.500000,15.0,8.698659
1,AssocProf,A,Male,17.727273,12.5,12.209215,13.136364,8.0,12.302905
2,AssocProf,B,Female,13.500000,12.5,2.880972,8.833333,9.5,1.940790
3,AssocProf,B,Male,13.875000,10.5,8.507113,11.281250,8.0,9.585723
4,AsstProf,A,Female,4.833333,4.5,2.316607,2.500000,2.5,2.073644
5,AsstProf,A,Male,5.944444,5.5,2.508157,2.388889,3.0,1.539247
6,AsstProf,B,Female,6.600000,5.0,3.646917,2.600000,3.0,1.816590
7,AsstProf,B,Male,4.552632,4.0,2.344601,2.315789,2.5,1.397010
8,Prof,A,Female,26.500000,28.0,9.023778,16.125000,14.5,11.319231
9,Prof,A,Male,30.747967,31.0,10.152601,24.983740,25.0,12.010913
10,Prof,B,Female,21.500000,19.0,5.948856,17.900000,17.5,4.771443
11,Prof,B,Male,26.552000,25.0,9.841040,21.504000,20.0,11.182232